## ✅ Terraform Plan (Staging) SUCCESS

<details>
<summary>Click to expand plan output</summary>

```

> autonyan-cloud-functions@1.0.0 terraform:plan
> npm run build:function && terraform -chdir=terraform plan -lock-timeout=5m


> autonyan-cloud-functions@1.0.0 build:function
> ./scripts/build-function.sh

Copying shared utilities...
  - Copying shared utilities to text-firebase-writer...
  - Copying shared utilities to doc-processor...
  - Copying shared utilities to drive-scanner...
  - Copying shared utilities to text-vision-processor...
  - Copying shared utilities to file-classifier...
Building shared module...

> autonyan-shared@1.0.0 build
> tsc

Building TypeScript...

> autonyan-cloud-functions@1.0.0 build
> npm run build --workspaces


> doc-processor-function@1.0.0 build
> tsc


> drive-scanner-function@1.0.0 build
> tsc


> file-classifier@1.0.0 build
> tsc


> text-firebase-writer@1.0.0 build
> tsc


> text-vision-processor@1.0.0 build
> tsc


> autonyan-shared@1.0.0 build
> tsc

Preparing function packages...
  - Preparing text-firebase-writer function package...
  - Preparing doc-processor function package...
  - Preparing drive-scanner function package...
  - Preparing text-vision-processor function package...
  - Preparing file-classifier function package...
Creating function zips...
  - Creating text-firebase-writer function zip...
  adding: index.ts (deflated 70%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating doc-processor function zip...
  adding: index.ts (deflated 67%)
  adding: package.json (deflated 57%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating drive-scanner function zip...
  adding: index.ts (deflated 64%)
  adding: package.json (deflated 58%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating text-vision-processor function zip...
  adding: index.ts (deflated 68%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 41%)
  - Creating file-classifier function zip...
  adding: drive-operations.ts (deflated 60%)
  adding: classification.ts (deflated 57%)
  adding: index.ts (deflated 69%)
  adding: firestore-operations.ts (deflated 65%)
  adding: package.json (deflated 55%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 48%)
Cleaning up shared utilities...
Build complete! Function zips created:
  - dist/functions/text-firebase-writer.zip
  - dist/functions/doc-processor.zip
  - dist/functions/drive-scanner.zip
  - dist/functions/text-vision-processor.zip
  - dist/functions/file-classifier.zip
[0m[1mdata.google_storage_project_service_account.gcs_account: Reading...[0m[0m
[0m[1mdata.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-740634168833@gs-project-accounts.iam.gserviceaccount.com][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # google_cloud_scheduler_job.drive_scan_schedule[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "drive_scan_schedule" {
      [32m+[0m[0m description = "Automated scheduler for Google Drive document scanning and classification (staging)"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "staging-drive-scan-schedule"
      [32m+[0m[0m paused      = (known after apply)
      [32m+[0m[0m project     = "home-hack-388806"
      [32m+[0m[0m region      = "asia-northeast1"
      [32m+[0m[0m schedule    = "0 * * * *"
      [32m+[0m[0m state       = (known after apply)
      [32m+[0m[0m time_zone   = "UTC"

      [32m+[0m[0m pubsub_target {
          [32m+[0m[0m data       = "eyJmb2xkZXJJZCI6IjFhYm5EclNwRDF5SlRpN0Vtazh6ODZNMlJjTEh2S2d1WSJ9"
          [32m+[0m[0m topic_name = (known after apply)
        }
    }

[1m  # google_firestore_database.default[0m will be created
[0m  [32m+[0m[0m resource "google_firestore_database" "default" {
      [32m+[0m[0m app_engine_integration_mode       = (known after apply)
      [32m+[0m[0m concurrency_mode                  = (known after apply)
      [32m+[0m[0m create_time                       = (known after apply)
      [32m+[0m[0m database_edition                  = (known after apply)
      [32m+[0m[0m delete_protection_state           = (known after apply)
      [32m+[0m[0m deletion_policy                   = "DELETE"
      [32m+[0m[0m earliest_version_time             = (known after apply)
      [32m+[0m[0m etag                              = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m key_prefix                        = (known after apply)
      [32m+[0m[0m location_id                       = "asia-northeast1"
      [32m+[0m[0m name                              = "(default)"
      [32m+[0m[0m point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      [32m+[0m[0m project                           = "home-hack-388806"
      [32m+[0m[0m type                              = "FIRESTORE_NATIVE"
      [32m+[0m[0m uid                               = (known after apply)
      [32m+[0m[0m update_time                       = (known after apply)
      [32m+[0m[0m version_retention_period          = (known after apply)
    }

[1m  # google_project_iam_member.gcs_pubsub_publisher[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "gcs_pubsub_publisher" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:service-740634168833@gs-project-accounts.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/pubsub.publisher"
    }

[1m  # google_project_service.cloudfunctions_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "cloudfunctions_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "cloudfunctions.googleapis.com"
    }

[1m  # google_project_service.drive_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "drive_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "drive.googleapis.com"
    }

[1m  # google_project_service.firestore_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "firestore_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "firestore.googleapis.com"
    }

[1m  # google_project_service.pubsub_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "pubsub_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "pubsub.googleapis.com"
    }

[1m  # google_project_service.vertex_ai_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "vertex_ai_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "aiplatform.googleapis.com"
    }

[1m  # google_project_service.vision_api[0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "vision_api" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "home-hack-388806"
      [32m+[0m[0m service            = "vision.googleapis.com"
    }

[1m  # google_storage_bucket.document_storage[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "document_storage" {
      [32m+[0m[0m effective_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m location                    = "ASIA-NORTHEAST1"
      [32m+[0m[0m name                        = "home-hack-388806-staging-document-storage"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m project_number              = (known after apply)
      [32m+[0m[0m public_access_prevention    = (known after apply)
      [32m+[0m[0m rpo                         = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m terraform_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m time_created                = (known after apply)
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m updated                     = (known after apply)
      [32m+[0m[0m url                         = (known after apply)
    }

[1m  # google_storage_bucket.function_bucket[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "function_bucket" {
      [32m+[0m[0m effective_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m location                    = "ASIA-NORTHEAST1"
      [32m+[0m[0m name                        = "home-hack-388806-staging-function-source"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m project_number              = (known after apply)
      [32m+[0m[0m public_access_prevention    = (known after apply)
      [32m+[0m[0m rpo                         = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m terraform_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m time_created                = (known after apply)
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m updated                     = (known after apply)
      [32m+[0m[0m url                         = (known after apply)
    }

[1m  # google_storage_bucket.vision_results[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "vision_results" {
      [32m+[0m[0m effective_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m location                    = "ASIA-NORTHEAST1"
      [32m+[0m[0m name                        = "home-hack-388806-staging-vision-results"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m project_number              = (known after apply)
      [32m+[0m[0m public_access_prevention    = (known after apply)
      [32m+[0m[0m rpo                         = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m terraform_labels            = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m time_created                = (known after apply)
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m updated                     = (known after apply)
      [32m+[0m[0m url                         = (known after apply)
    }

[1m  # module.doc_processor.google_cloudfunctions2_function.doc_processor[0m will be created
[0m  [32m+[0m[0m resource "google_cloudfunctions2_function" "doc_processor" {
      [32m+[0m[0m description      = "Prepares documents for scanning by copying Google Drive files to Cloud Storage (staging)"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m environment      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "asia-northeast1"
      [32m+[0m[0m name             = "staging-doc-processor"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m update_time      = (known after apply)
      [32m+[0m[0m url              = (known after apply)

      [32m+[0m[0m build_config {
          [32m+[0m[0m build                 = (known after apply)
          [32m+[0m[0m docker_repository     = (known after apply)
          [32m+[0m[0m entry_point           = "docProcessor"
          [32m+[0m[0m environment_variables = (known after apply)
          [32m+[0m[0m runtime               = "nodejs20"
          [32m+[0m[0m service_account       = (known after apply)

          [32m+[0m[0m source {
              [32m+[0m[0m storage_source {
                  [32m+[0m[0m bucket     = "home-hack-388806-staging-function-source"
                  [32m+[0m[0m generation = (known after apply)
                  [32m+[0m[0m object     = "doc-processor.zip"
                }
            }
        }

      [32m+[0m[0m event_trigger {
          [32m+[0m[0m event_type            = "google.cloud.pubsub.topic.v1.messagePublished"
          [32m+[0m[0m pubsub_topic          = (known after apply)
          [32m+[0m[0m retry_policy          = "RETRY_POLICY_RETRY"
          [32m+[0m[0m service_account_email = (known after apply)
          [32m+[0m[0m trigger               = (known after apply)
          [32m+[0m[0m trigger_region        = (known after apply)
        }

      [32m+[0m[0m service_config {
          [32m+[0m[0m all_traffic_on_latest_revision   = true
          [32m+[0m[0m available_cpu                    = (known after apply)
          [32m+[0m[0m available_memory                 = "512M"
          [32m+[0m[0m environment_variables            = {
              [32m+[0m[0m "NODE_ENV"   = "production"
              [32m+[0m[0m "PROJECT_ID" = "home-hack-388806"
            }
          [32m+[0m[0m gcf_uri                          = (known after apply)
          [32m+[0m[0m ingress_settings                 = "ALLOW_ALL"
          [32m+[0m[0m max_instance_count               = 100
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m min_instance_count               = 0
          [32m+[0m[0m service                          = (known after apply)
          [32m+[0m[0m service_account_email            = "staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
          [32m+[0m[0m timeout_seconds                  = 540
          [32m+[0m[0m uri                              = (known after apply)
        }
    }

[1m  # module.doc_processor.google_project_iam_member.doc_processor_service_usage[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "doc_processor_service_usage" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/serviceusage.serviceUsageConsumer"
    }

[1m  # module.doc_processor.google_project_iam_member.doc_processor_storage_access[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "doc_processor_storage_access" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/storage.objectAdmin"
    }

[1m  # module.doc_processor.google_pubsub_topic.doc_process_trigger[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic" "doc_process_trigger" {
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "staging-doc-process-trigger"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
    }

[1m  # module.doc_processor.google_service_account.doc_processor_sa[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "doc_processor_sa" {
      [32m+[0m[0m account_id   = "staging-doc-processor-sa"
      [32m+[0m[0m description  = "Service account for Google Drive access and Cloud Storage operations"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Document Processor Service Account (staging)"
      [32m+[0m[0m email        = "staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = "serviceAccount:staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "home-hack-388806"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.doc_processor.google_storage_bucket_object.doc_processor_zip[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_object" "doc_processor_zip" {
      [32m+[0m[0m bucket         = "home-hack-388806-staging-function-source"
      [32m+[0m[0m content        = (sensitive value)
      [32m+[0m[0m content_type   = (known after apply)
      [32m+[0m[0m crc32c         = (known after apply)
      [32m+[0m[0m detect_md5hash = "different hash"
      [32m+[0m[0m generation     = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m kms_key_name   = (known after apply)
      [32m+[0m[0m md5hash        = (known after apply)
      [32m+[0m[0m md5hexhash     = (known after apply)
      [32m+[0m[0m media_link     = (known after apply)
      [32m+[0m[0m name           = "doc-processor.zip"
      [32m+[0m[0m output_name    = (known after apply)
      [32m+[0m[0m self_link      = (known after apply)
      [32m+[0m[0m source         = "../dist/functions/doc-processor.zip"
      [32m+[0m[0m storage_class  = (known after apply)
    }

[1m  # module.drive_scanner.google_cloudfunctions2_function.drive_scanner[0m will be created
[0m  [32m+[0m[0m resource "google_cloudfunctions2_function" "drive_scanner" {
      [32m+[0m[0m description      = "Automated Google Drive scanner that discovers documents and queues them for classification processing (staging)"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m environment      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "asia-northeast1"
      [32m+[0m[0m name             = "staging-drive-scanner"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m update_time      = (known after apply)
      [32m+[0m[0m url              = (known after apply)

      [32m+[0m[0m build_config {
          [32m+[0m[0m build                 = (known after apply)
          [32m+[0m[0m docker_repository     = (known after apply)
          [32m+[0m[0m entry_point           = "driveScanner"
          [32m+[0m[0m environment_variables = (known after apply)
          [32m+[0m[0m runtime               = "nodejs20"
          [32m+[0m[0m service_account       = (known after apply)

          [32m+[0m[0m source {
              [32m+[0m[0m storage_source {
                  [32m+[0m[0m bucket     = "home-hack-388806-staging-function-source"
                  [32m+[0m[0m generation = (known after apply)
                  [32m+[0m[0m object     = "drive-scanner.zip"
                }
            }
        }

      [32m+[0m[0m event_trigger {
          [32m+[0m[0m event_type            = "google.cloud.pubsub.topic.v1.messagePublished"
          [32m+[0m[0m pubsub_topic          = (known after apply)
          [32m+[0m[0m retry_policy          = "RETRY_POLICY_RETRY"
          [32m+[0m[0m service_account_email = (known after apply)
          [32m+[0m[0m trigger               = (known after apply)
          [32m+[0m[0m trigger_region        = (known after apply)
        }

      [32m+[0m[0m service_config {
          [32m+[0m[0m all_traffic_on_latest_revision   = true
          [32m+[0m[0m available_cpu                    = (known after apply)
          [32m+[0m[0m available_memory                 = "512M"
          [32m+[0m[0m environment_variables            = {
              [32m+[0m[0m "DOC_PROCESS_TRIGGER_TOPIC" = "staging-doc-process-trigger"
              [32m+[0m[0m "NODE_ENV"                  = "production"
            }
          [32m+[0m[0m gcf_uri                          = (known after apply)
          [32m+[0m[0m ingress_settings                 = "ALLOW_ALL"
          [32m+[0m[0m max_instance_count               = 10
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m min_instance_count               = 0
          [32m+[0m[0m service                          = (known after apply)
          [32m+[0m[0m service_account_email            = "staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
          [32m+[0m[0m timeout_seconds                  = 300
          [32m+[0m[0m uri                              = (known after apply)
        }
    }

[1m  # module.drive_scanner.google_project_iam_member.pubsub_publisher[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "pubsub_publisher" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/pubsub.publisher"
    }

[1m  # module.drive_scanner.google_project_iam_member.service_usage[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "service_usage" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/serviceusage.serviceUsageConsumer"
    }

[1m  # module.drive_scanner.google_project_iam_member.storage_access[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "storage_access" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/storage.objectViewer"
    }

[1m  # module.drive_scanner.google_pubsub_topic.drive_scan_trigger[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic" "drive_scan_trigger" {
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "staging-drive-scan-trigger"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
    }

[1m  # module.drive_scanner.google_service_account.drive_scanner_sa[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "drive_scanner_sa" {
      [32m+[0m[0m account_id   = "staging-drive-scanner-sa"
      [32m+[0m[0m description  = "Service account for Google Drive access via folder sharing and PubSub publishing"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Drive File Manager Service Account (staging)"
      [32m+[0m[0m email        = "staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = "serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "home-hack-388806"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.drive_scanner.google_storage_bucket_object.drive_scanner_zip[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_object" "drive_scanner_zip" {
      [32m+[0m[0m bucket         = "home-hack-388806-staging-function-source"
      [32m+[0m[0m content        = (sensitive value)
      [32m+[0m[0m content_type   = (known after apply)
      [32m+[0m[0m crc32c         = (known after apply)
      [32m+[0m[0m detect_md5hash = "different hash"
      [32m+[0m[0m generation     = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m kms_key_name   = (known after apply)
      [32m+[0m[0m md5hash        = (known after apply)
      [32m+[0m[0m md5hexhash     = (known after apply)
      [32m+[0m[0m media_link     = (known after apply)
      [32m+[0m[0m name           = "drive-scanner.zip"
      [32m+[0m[0m output_name    = (known after apply)
      [32m+[0m[0m self_link      = (known after apply)
      [32m+[0m[0m source         = "../dist/functions/drive-scanner.zip"
      [32m+[0m[0m storage_class  = (known after apply)
    }

[1m  # module.file_classifier.google_cloudfunctions2_function.file_classifier[0m will be created
[0m  [32m+[0m[0m resource "google_cloudfunctions2_function" "file_classifier" {
      [32m+[0m[0m description      = "Classify documents using AI and move them to categorized folders in Google Drive (staging)"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m environment      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "asia-northeast1"
      [32m+[0m[0m name             = "staging-file-classifier"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m update_time      = (known after apply)
      [32m+[0m[0m url              = (known after apply)

      [32m+[0m[0m build_config {
          [32m+[0m[0m build                 = (known after apply)
          [32m+[0m[0m docker_repository     = (known after apply)
          [32m+[0m[0m entry_point           = "fileClassifier"
          [32m+[0m[0m environment_variables = (known after apply)
          [32m+[0m[0m runtime               = "nodejs20"
          [32m+[0m[0m service_account       = (known after apply)

          [32m+[0m[0m source {
              [32m+[0m[0m storage_source {
                  [32m+[0m[0m bucket     = "home-hack-388806-staging-function-source"
                  [32m+[0m[0m generation = (known after apply)
                  [32m+[0m[0m object     = "file-classifier.zip"
                }
            }
        }

      [32m+[0m[0m event_trigger {
          [32m+[0m[0m event_type            = "google.cloud.firestore.document.v1.created"
          [32m+[0m[0m pubsub_topic          = (known after apply)
          [32m+[0m[0m retry_policy          = "RETRY_POLICY_RETRY"
          [32m+[0m[0m service_account_email = (known after apply)
          [32m+[0m[0m trigger               = (known after apply)
          [32m+[0m[0m trigger_region        = "asia-northeast1"

          [32m+[0m[0m event_filters {
              [32m+[0m[0m attribute = "database"
              [32m+[0m[0m value     = "(default)"
            }
          [32m+[0m[0m event_filters {
              [32m+[0m[0m attribute = "document"
              [32m+[0m[0m value     = "extracted_texts/{documentId}"
            }
        }

      [32m+[0m[0m service_config {
          [32m+[0m[0m all_traffic_on_latest_revision   = true
          [32m+[0m[0m available_cpu                    = (known after apply)
          [32m+[0m[0m available_memory                 = "512Mi"
          [32m+[0m[0m environment_variables            = {
              [32m+[0m[0m "CATEGORY_ROOT_FOLDER_ID" = "1tj-Y2LW2izZvgvm2-swY27_NgBCOm2B0"
              [32m+[0m[0m "PROJECT_ID"              = "home-hack-388806"
              [32m+[0m[0m "UNCATEGORIZED_FOLDER_ID" = "1FFzzPRCIDCflVAP4Bhj9HTVVa10Kew8O"
            }
          [32m+[0m[0m gcf_uri                          = (known after apply)
          [32m+[0m[0m ingress_settings                 = "ALLOW_ALL"
          [32m+[0m[0m max_instance_count               = 10
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m min_instance_count               = 0
          [32m+[0m[0m service                          = (known after apply)
          [32m+[0m[0m service_account_email            = "staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
          [32m+[0m[0m timeout_seconds                  = 300
          [32m+[0m[0m uri                              = (known after apply)
        }
    }

[1m  # module.file_classifier.google_project_iam_member.file_classifier_eventarc[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "file_classifier_eventarc" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/eventarc.eventReceiver"
    }

[1m  # module.file_classifier.google_project_iam_member.file_classifier_firestore[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "file_classifier_firestore" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/datastore.user"
    }

[1m  # module.file_classifier.google_project_iam_member.file_classifier_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "file_classifier_invoker" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/run.invoker"
    }

[1m  # module.file_classifier.google_project_iam_member.file_classifier_vertex_ai[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "file_classifier_vertex_ai" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/aiplatform.user"
    }

[1m  # module.file_classifier.google_service_account.file_classifier[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "file_classifier" {
      [32m+[0m[0m account_id   = "staging-file-classifier"
      [32m+[0m[0m description  = "Service account for file-classifier Cloud Function"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "File Classifier Service Account (staging)"
      [32m+[0m[0m email        = "staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = "serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "home-hack-388806"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.file_classifier.google_storage_bucket_object.file_classifier_zip[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_object" "file_classifier_zip" {
      [32m+[0m[0m bucket         = "home-hack-388806-staging-function-source"
      [32m+[0m[0m content        = (sensitive value)
      [32m+[0m[0m content_type   = (known after apply)
      [32m+[0m[0m crc32c         = (known after apply)
      [32m+[0m[0m detect_md5hash = "different hash"
      [32m+[0m[0m generation     = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m kms_key_name   = (known after apply)
      [32m+[0m[0m md5hash        = (known after apply)
      [32m+[0m[0m md5hexhash     = (known after apply)
      [32m+[0m[0m media_link     = (known after apply)
      [32m+[0m[0m name           = "file-classifier.zip"
      [32m+[0m[0m output_name    = (known after apply)
      [32m+[0m[0m self_link      = (known after apply)
      [32m+[0m[0m source         = "../dist/functions/file-classifier.zip"
      [32m+[0m[0m storage_class  = (known after apply)
    }

[1m  # module.text_firebase_writer.google_cloudfunctions2_function.text_firebase_writer[0m will be created
[0m  [32m+[0m[0m resource "google_cloudfunctions2_function" "text_firebase_writer" {
      [32m+[0m[0m description      = "Store Vision API text extraction results to Firestore (staging)"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m environment      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "asia-northeast1"
      [32m+[0m[0m name             = "staging-text-firebase-writer"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m update_time      = (known after apply)
      [32m+[0m[0m url              = (known after apply)

      [32m+[0m[0m build_config {
          [32m+[0m[0m build                 = (known after apply)
          [32m+[0m[0m docker_repository     = (known after apply)
          [32m+[0m[0m entry_point           = "textFirebaseWriter"
          [32m+[0m[0m environment_variables = (known after apply)
          [32m+[0m[0m runtime               = "nodejs20"
          [32m+[0m[0m service_account       = (known after apply)

          [32m+[0m[0m source {
              [32m+[0m[0m storage_source {
                  [32m+[0m[0m bucket     = "home-hack-388806-staging-function-source"
                  [32m+[0m[0m generation = (known after apply)
                  [32m+[0m[0m object     = "text-firebase-writer.zip"
                }
            }
        }

      [32m+[0m[0m event_trigger {
          [32m+[0m[0m event_type            = "google.cloud.storage.object.v1.finalized"
          [32m+[0m[0m pubsub_topic          = (known after apply)
          [32m+[0m[0m retry_policy          = "RETRY_POLICY_RETRY"
          [32m+[0m[0m service_account_email = (known after apply)
          [32m+[0m[0m trigger               = (known after apply)
          [32m+[0m[0m trigger_region        = "asia-northeast1"

          [32m+[0m[0m event_filters {
              [32m+[0m[0m attribute = "bucket"
              [32m+[0m[0m value     = "home-hack-388806-staging-vision-results"
            }
        }

      [32m+[0m[0m service_config {
          [32m+[0m[0m all_traffic_on_latest_revision   = true
          [32m+[0m[0m available_cpu                    = (known after apply)
          [32m+[0m[0m available_memory                 = "512Mi"
          [32m+[0m[0m environment_variables            = {
              [32m+[0m[0m "PROJECT_ID" = "home-hack-388806"
            }
          [32m+[0m[0m gcf_uri                          = (known after apply)
          [32m+[0m[0m ingress_settings                 = "ALLOW_ALL"
          [32m+[0m[0m max_instance_count               = 10
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m min_instance_count               = 0
          [32m+[0m[0m service                          = (known after apply)
          [32m+[0m[0m service_account_email            = "staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
          [32m+[0m[0m timeout_seconds                  = 300
          [32m+[0m[0m uri                              = (known after apply)
        }
    }

[1m  # module.text_firebase_writer.google_project_iam_member.text_firebase_writer_firestore[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "text_firebase_writer_firestore" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/datastore.user"
    }

[1m  # module.text_firebase_writer.google_service_account.text_firebase_writer[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "text_firebase_writer" {
      [32m+[0m[0m account_id   = "staging-text-fb-writer"
      [32m+[0m[0m description  = "Service account for text-firebase-writer Cloud Function"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Text Firebase Writer Service Account (staging)"
      [32m+[0m[0m email        = "staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = "serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "home-hack-388806"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_document_storage[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "text_firebase_writer_document_storage" {
      [32m+[0m[0m bucket = "home-hack-388806-staging-document-storage"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = "serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m role   = "roles/storage.objectViewer"
    }

[1m  # module.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_vision_results[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "text_firebase_writer_vision_results" {
      [32m+[0m[0m bucket = "home-hack-388806-staging-vision-results"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = "serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m role   = "roles/storage.objectViewer"
    }

[1m  # module.text_firebase_writer.google_storage_bucket_object.text_firebase_writer_zip[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_object" "text_firebase_writer_zip" {
      [32m+[0m[0m bucket         = "home-hack-388806-staging-function-source"
      [32m+[0m[0m content        = (sensitive value)
      [32m+[0m[0m content_type   = (known after apply)
      [32m+[0m[0m crc32c         = (known after apply)
      [32m+[0m[0m detect_md5hash = "different hash"
      [32m+[0m[0m generation     = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m kms_key_name   = (known after apply)
      [32m+[0m[0m md5hash        = (known after apply)
      [32m+[0m[0m md5hexhash     = (known after apply)
      [32m+[0m[0m media_link     = (known after apply)
      [32m+[0m[0m name           = "text-firebase-writer.zip"
      [32m+[0m[0m output_name    = (known after apply)
      [32m+[0m[0m self_link      = (known after apply)
      [32m+[0m[0m source         = "../dist/functions/text-firebase-writer.zip"
      [32m+[0m[0m storage_class  = (known after apply)
    }

[1m  # module.text_vision_processor.google_cloudfunctions2_function.text_vision_processor[0m will be created
[0m  [32m+[0m[0m resource "google_cloudfunctions2_function" "text_vision_processor" {
      [32m+[0m[0m description      = "Process documents with Vision API for text extraction (staging)"
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m environment      = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m location         = "asia-northeast1"
      [32m+[0m[0m name             = "staging-text-vision-processor"
      [32m+[0m[0m project          = "home-hack-388806"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "goog-terraform-provisioned" = "true"
        }
      [32m+[0m[0m update_time      = (known after apply)
      [32m+[0m[0m url              = (known after apply)

      [32m+[0m[0m build_config {
          [32m+[0m[0m build                 = (known after apply)
          [32m+[0m[0m docker_repository     = (known after apply)
          [32m+[0m[0m entry_point           = "textVisionProcessor"
          [32m+[0m[0m environment_variables = (known after apply)
          [32m+[0m[0m runtime               = "nodejs20"
          [32m+[0m[0m service_account       = (known after apply)

          [32m+[0m[0m source {
              [32m+[0m[0m storage_source {
                  [32m+[0m[0m bucket     = "home-hack-388806-staging-function-source"
                  [32m+[0m[0m generation = (known after apply)
                  [32m+[0m[0m object     = "text-vision-processor.zip"
                }
            }
        }

      [32m+[0m[0m event_trigger {
          [32m+[0m[0m event_type            = "google.cloud.storage.object.v1.finalized"
          [32m+[0m[0m pubsub_topic          = (known after apply)
          [32m+[0m[0m retry_policy          = "RETRY_POLICY_RETRY"
          [32m+[0m[0m service_account_email = (known after apply)
          [32m+[0m[0m trigger               = (known after apply)
          [32m+[0m[0m trigger_region        = "asia-northeast1"

          [32m+[0m[0m event_filters {
              [32m+[0m[0m attribute = "bucket"
              [32m+[0m[0m value     = "home-hack-388806-staging-document-storage"
            }
        }

      [32m+[0m[0m service_config {
          [32m+[0m[0m all_traffic_on_latest_revision   = true
          [32m+[0m[0m available_cpu                    = (known after apply)
          [32m+[0m[0m available_memory                 = "1Gi"
          [32m+[0m[0m environment_variables            = {
              [32m+[0m[0m "PROJECT_ID" = "home-hack-388806"
            }
          [32m+[0m[0m gcf_uri                          = (known after apply)
          [32m+[0m[0m ingress_settings                 = "ALLOW_ALL"
          [32m+[0m[0m max_instance_count               = 10
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m min_instance_count               = 0
          [32m+[0m[0m service                          = (known after apply)
          [32m+[0m[0m service_account_email            = "staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
          [32m+[0m[0m timeout_seconds                  = 540
          [32m+[0m[0m uri                              = (known after apply)
        }
    }

[1m  # module.text_vision_processor.google_project_iam_member.text_vision_processor_vision[0m will be created
[0m  [32m+[0m[0m resource "google_project_iam_member" "text_vision_processor_vision" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = "serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m project = "home-hack-388806"
      [32m+[0m[0m role    = "roles/ml.developer"
    }

[1m  # module.text_vision_processor.google_service_account.text_vision_processor[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "text_vision_processor" {
      [32m+[0m[0m account_id   = "staging-text-vision-proc"
      [32m+[0m[0m description  = "Service account for text-vision-processor Cloud Function"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Text Vision Processor Service Account (staging)"
      [32m+[0m[0m email        = "staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = "serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "home-hack-388806"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_document_storage[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "text_vision_processor_document_storage" {
      [32m+[0m[0m bucket = "home-hack-388806-staging-document-storage"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = "serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m role   = "roles/storage.objectViewer"
    }

[1m  # module.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_vision_results[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "text_vision_processor_vision_results" {
      [32m+[0m[0m bucket = "home-hack-388806-staging-vision-results"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = "serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.text_vision_processor.google_storage_bucket_object.text_vision_processor_zip[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_object" "text_vision_processor_zip" {
      [32m+[0m[0m bucket         = "home-hack-388806-staging-function-source"
      [32m+[0m[0m content        = (sensitive value)
      [32m+[0m[0m content_type   = (known after apply)
      [32m+[0m[0m crc32c         = (known after apply)
      [32m+[0m[0m detect_md5hash = "different hash"
      [32m+[0m[0m generation     = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m kms_key_name   = (known after apply)
      [32m+[0m[0m md5hash        = (known after apply)
      [32m+[0m[0m md5hexhash     = (known after apply)
      [32m+[0m[0m media_link     = (known after apply)
      [32m+[0m[0m name           = "text-vision-processor.zip"
      [32m+[0m[0m output_name    = (known after apply)
      [32m+[0m[0m self_link      = (known after apply)
      [32m+[0m[0m source         = "../dist/functions/text-vision-processor.zip"
      [32m+[0m[0m storage_class  = (known after apply)
    }

[1mPlan:[0m 44 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m doc_process_trigger_topic                   = "staging-doc-process-trigger"
  [32m+[0m[0m doc_processor_service_account_email         = "staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com"
  [32m+[0m[0m document_storage_bucket                     = "home-hack-388806-staging-document-storage"
  [32m+[0m[0m drive_folder_setup_instructions             = <<-EOT
        IMPORTANT: Google Drive access is granted through MANUAL SHARING only.
        Drive API roles cannot be assigned at the project level.
        
        Required Setup Steps:
        
        STEP 1 - Share Your Drive/Folders:
        1. Open Google Drive (https://drive.google.com)
        2. To grant access to entire Drive:
           - Right-click "My Drive" and select "Share"
        3. To grant access to specific folders:
           - Right-click the folder(s) and select "Share"
        4. Add these emails as editors:
           - Drive Scanner: staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com
           - Document Processor: staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com
           - File Classifier: staging-file-classifier@home-hack-388806.iam.gserviceaccount.com
        5. Set permission level to "Editor"
        6. Click "Send"
        
        STEP 2 - Configure Folder ID:
        Set drive_folder_id in terraform.tfvars:
        - For entire Drive: drive_folder_id = "root"
        - For specific folder: drive_folder_id = "FOLDER_ID_FROM_URL"
        
        Permissions: Once shared, the service account can:
        ✅ List files and folders (in shared areas only)
        ✅ Create new folders (in shared areas only)
        ✅ Move files between folders (within shared areas)
        ✅ Copy files (within shared areas)
        ✅ Read file metadata
        ❌ Access unshared folders
        ❌ Delete files or folders
        ❌ Manage sharing permissions
        
        Get folder ID from URLs like:
        https://drive.google.com/drive/folders/FOLDER_ID_HERE
    EOT
  [32m+[0m[0m file_classifier_service_account_email       = "staging-file-classifier@home-hack-388806.iam.gserviceaccount.com"
  [32m+[0m[0m service_account_email                       = "staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com"
  [32m+[0m[0m text_firebase_writer_service_account_email  = "staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com"
  [32m+[0m[0m text_vision_processor_service_account_email = "staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com"
  [32m+[0m[0m vision_results_bucket                       = "home-hack-388806-staging-vision-results"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Auto-triggered after Test workflow success*